Agat/src/Catalogs/ДоговораСубподряда/ДоговораСубподряда.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговораСубподряда</name>
  <basedOn>Catalog.Договора</basedOn>
  <attributes>
    <name>НомерДоговора</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаключения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредметДоговораПолностью</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорСЗаказчиком</name>
    <type>
      <types>CatalogRef.Договора</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаДоговора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйИсполнитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Тематика</name>
    <type>
      <types>CatalogRef.Тематика</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Приложения</name>
    <attributes>
      <name>НаименованиеДокумента</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификатор</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Действие</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Удалить</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РасширениеФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Разногласия</name>
    <attributes>
      <name>НаименованиеДокумента</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВходящийНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВходящийДата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отправитель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Адресат</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификатор</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Действие</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Удалить</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РасширениеФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсполнениеДоговора</name>
    <attributes>
      <name>НаименованиеДокумента</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОплаты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаИсполнения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификатор</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Действие</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Удалить</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РасширениеФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СодержаниеДоговора</name>
    <attributes>
      <name>НомерПунктаДоговора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Версия</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасширениеФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификатор</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Архив</name>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеДокумента</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РасширениеФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификатор</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Agat/src/Catalogs/ДоговораСубподряда/Forms/ФормаСписка/Module.bsl
// EXCEL // Заполнение реквизитов справочника из EXCEL работает с ОбщейФормой 
 //       // ДиалогНастройкиКолонок и Общим модулем ЗагрузкаДанныхСервер
 /////////////////////////////////////////////////////////////////////////////////////////// 
 ///////////////////////////////////////////////////////////////////////////////////////////
 &НаКлиенте
Процедура ЗагрузитьИзExcel(Команда)
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтотОбъект);
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Excel (*.xlsx)|*.xlsx";
	Диалог.Показать(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	Если ВыбранныеФайлы = Неопределено Тогда Возврат; КонецЕсли;
	
	// Извлекаем путь (строку) из массива
	ЭтаФорма.ПутьКФайлу = ?(ТипЗнч(ВыбранныеФайлы) = Тип("Массив"), ВыбранныеФайлы[0], ВыбранныеФайлы);
	
	// ОПРЕДЕЛЯЕМ КОНКРЕТНЫЕ РЕКВИЗИТЫ ДЛЯ ЗАПОЛНЕНИЯ в коде
	СписокПолей = Новый СписокЗначений;
	СписокПолей.Добавить("НомерДоговора",          "Номер договора");
	СписокПолей.Добавить("ДатаЗаключения",          "Дата заключения");	
	СписокПолей.Добавить("Наименование",         "Предмет договора сокращенно");
	СписокПолей.Добавить("ПредметДоговораПолностью",          "Предмет договора полностью");	
	СписокПолей.Добавить("Контрагент",    "Контрагент");  
	СписокПолей.Добавить("СрокИсполнения",    "Срок исполнения");
	СписокПолей.Добавить("ДатаИсполнения", "Дата исполнения");  
	СписокПолей.Добавить("Примечание",    "Примечание");     		
	СписокПолей.Добавить("ДоговорСЗаказчиком",    "Договор с Заказчиком");	
	СписокПолей.Добавить("ЦенаДоговора",    "Цена договора"); 	
	СписокПолей.Добавить("ОтветственныйИсполнитель",          "Ответственный исполнитель"); 
	//////////////////////////////////////////////////////////////////////////////
	
	ПараметрыДиалога = Новый Структура;
	ПараметрыДиалога.Вставить("СписокПолей",    СписокПолей);
	ПараметрыДиалога.Вставить("СписокЛистов",   ЗагрузкаДанныхСервер.ПолучитьСписокЛистов(ЭтаФорма.ПутьКФайлу));
	ПараметрыДиалога.Вставить("ИмяСправочника", "ДоговораСубподряда");

	// Открытие ОТДЕЛЬНОГО БЛОКИРУЮЩЕГО ОКНА
	ОповещениеЗакрытия = Новый ОписаниеОповещения("ПослеНастройки", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ДиалогНастройкиКолонок", 
	             ПараметрыДиалога, 
	             ЭтотОбъект, 
	             Истина, // Уникальность
	             , 
	             , 
	             ОповещениеЗакрытия, 
	             РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ПослеНастройки(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда Возврат; КонецЕсли;

	Попытка
		Лог = ЗагрузкаДанныхСервер.ЗагрузитьДанные(
			Неопределено, 
			ЭтаФорма.ПутьКФайлу, 
			Результат.НастройкиКолонок, 
			Результат.СтартоваяСтрока, 
			Результат.КонечнаяСтрока, 
			Результат.ИмяСправочника, 
			Результат.ИмяЛиста
		);
		Элементы.Список.Обновить();
		ПоказатьОповещениеПользователя("Загрузка завершена", , "Успешно: " + Лог.Успешно);
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры
 ///////////////////////////////////////////////////////////////////////////////////////////
 ///////////////////////////////////////////////////////////////////////////////////////////
